# 2889. Reshape Data: Pivot
[問題](https://leetcode.com/problems/reshape-data-pivot/?envType=study-plan-v2&envId=introduction-to-pandas&lang=pythondata)

In [1]:
import pandas as pd

In [16]:
def pivotTable(weather: pd.DataFrame) -> pd.DataFrame:
    weather = weather.pivot(index="month", columns="city", values="temperature")
    return weather

In [17]:
headers = ["city","month","temperature"]
weather = [["Jacksonville","January",13],["Jacksonville","February",23],["Jacksonville","March",38],["Jacksonville","April",5],["Jacksonville","May",34],["ElPaso","January",20],["ElPaso","February",6],["ElPaso","March",26],["ElPaso","April",2],["ElPaso","May",43]]

In [18]:
df = pd.DataFrame(weather, columns=headers)

In [19]:
df

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

In [20]:
pivotTable(df)

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34